/***********************************

 *全局配置文件
 *步兵
 ***********************************/
#ifndef __CONFIG_H
#define __CONFIG_H
#define PI  3.1415926f


/********************************************************************************************************************
 **********************************************用户层功能设置*********************************************************/
#define CHASSIS_POSITION_CRTL	//底盘位置环控制，注释掉时则仅使用速度环
//#define PITCH_IMU_CTRL	//云台pitch轴的控制使用imu测量的绝对角度数据作反馈，注释掉则使用电机码盘的相对角度作反馈


/*******************************************************************************************************************
 **************************************************配置声明*********************************************************
 *******************************************************************************************************************/


//*********************底盘机械参数*********************
#define MOTOR_P		14		//电机减速齿比
#define WHEEL_R		76		//轮子半径
#define CHASSIS_K	573		//K=0.5*(横轴长度+纵轴长度)mm  //计算旋转入口量


//******************3508电机极限性能********************
/*带19减速箱情况下实测得到

 ************************/
#define LIM_3508_SPEED	6880		//电调返回最大的速度值
#define LIM_3508_ANGLE	940			//每周期最大码值步长


//******************摇杆中位偏置************************
#define RC_ch0_Offset 0
#define RC_ch1_Offset 0
#define RC_ch2_Offset 0
#define RC_ch3_Offset 0


//***************云台电机配置声明********************
#define Yaw_Direction		 1			//电机安装方向，1或-1
#define Pitch_Direction	 -1			//电机安装方向，1或-1
#define Pitch_Mid_encode 1344   //Pitch轴电机中点码值
#define Yaw_Mid_encode 700      //Yaw轴电机中点码值


//*******************pid频率声明**********************
#define PID_Hz 500


/*******************************************************************************************************************
 ***************************************************性能设置********************************************************
 *******************************************************************************************************************/
 
//******************新版本底盘速度参数配置*********************
#define Wz_MAX_init 			 9.5f		//5.0	// rad/s,弧度每秒 4.5   小陀螺旋转速度也与这个限幅有关   6.5 测试结果表明电容最低最低也能保证小陀螺一个速度
#define Vx_MAX_init        5000   //3000     
#define Vy_MAX_init        5000   //2000


//******************底盘模式配置（血量优先or功率优先）*********************//
#define Chassis_mode_init 1 //功率优先为1，血量优先为0						

#define P_Level_1 59
#define P_Level_2 79
#define P_Level_3 99

#define Hp_Level_1 44
#define Hp_Level_2 49
#define Hp_Level_3 54


//******************发射模式配置（爆发优先or冷却优先）*********************//
#define Fire_mode_init 0  //爆发优先为1，冷却优先为0 上电默认初始化
#define Booming_fire 1  //爆发优先
#define Rerolling_fire 0  //冷却优先


//*********************扭腰模式相关***********************
#define TWIST_ANGLE						5			//扭腰的角度
#define TWIST_SPEED						3			//扭腰的速度


//*********************小陀螺模式相关***********************
#define SpinTop_SPEED         8      //小陀螺速度  //6
#define SpinTop_ANGLE         3      //小陀螺角度这里没有用到角度
#define SpinTop_Direction     1      //小陀螺旋转方向-1    //实测方向为1的时候底盘补偿会有问题 -1不会


/*******************************************************************************************************************
 ***************************************************PID设置*********************************************************
 *******************************************************************************************************************/
 
 
//****************底盘电机pid参数************************
//速度环pid
#define PID_MOTOR_SPEED_KP			3.8f
#define PID_MOTOR_SPEED_KI			0.1f
#define PID_MOTOR_SPEED_KD			0
#define PID_MOTOR_SPEED_I_MAX		(1500)	//积分最大值
#define PID_MOTOR_SPEED_I_Err		(500)		//积分分离值，差值在此值以内才进行积分
//位置环pid
#define PID_MOTOR_ANGLE_KP			(0.02f)
#define PID_MOTOR_ANGLE_KI			(0.0f)
#define PID_MOTOR_ANGLE_KD			(0.0f)


//****************自瞄云台yaw轴参数************************
#define VISION_PID_YAW_SPEED_I_MAX (30000.0f)
#define VISION_PID_YAW_SPEED_I_Err (100)
#define VISION_PID_YAW_ANGLE_I_MAX (30000.0f)
#define VISION_PID_YAW_ANGLE_I_Err (100)


//****************自瞄云台pitch轴参数**********************
#define VISION_PID_PITCH_SPEED_I_MAX (30000.0f)
#define VISION_PID_PITCH_SPEED_I_Err (100)
#define VISION_PID_PITCH_ANGLE_I_MAX (30000.0f)
#define VISION_PID_PITCH_ANGLE_I_Err (100)


//****************Pitch轴pid参数**************************
#define PID_PITCH_SPEED_I_MAX	(30000.0f)	//积分最大值
#define PID_PITCH_SPEED_I_Err	(100)	//积分分离值，差值在此值以内才进行积分
#define PID_PITCH_ANGLE_I_MAX	(30000.0f)	//积分最大值
#define PID_PITCH_ANGLE_I_Err	(10)	//积分分离值，差值在此值以内才进行积分


//****************Yaw轴pid参数**************************
#define PID_YAW_SPEED_I_MAX		(30000.0f)	//积分最大值
#define PID_YAW_SPEED_I_Err		(100)	//积分分离值，差值在此值以内才进行积分
#define PID_YAW_ANGLE_I_MAX		(0)	//积分最大值
#define PID_YAW_ANGLE_I_Err		(10)	//积分分离值，差值在此值以内才进行积分


//*************拨弹电机*****************
#define PID_FIRE_SPEED_KP			(10.0f)  //3.5f
#define PID_FIRE_SPEED_KI			(0.05f)
#define PID_FIRE_SPEED_KD			(0)     //6.0f
#define PID_FIRE_SPEED_I_MAX	(1000)	//积分最大值
#define DEGREE_60_TO_ENCODER   36860 

 
//***********************IMU参数************************
#define IMU_TEMP				9000		//目标温度  //修改该参数可缩短IMU校准时间
#define TEMP_Tolerance	60			//温度误差容忍度
#define TEMP_KP					2.4f
#define TEMP_KI					1
#define TEMP_KD					1


//***********************蜂鸣器参数************************
#define BUZZER_TIME			300			//蜂鸣器工作一次的时间长度，ms


#endif

